PREF_JP = (
    "",
    "北海道", "青森県", "岩手県", "宮城県", "秋田県", "山形県", "福島県", 
    "茨城県", "栃木県", "群馬県", "埼玉県", "千葉県", "東京都", "神奈川県",
    "新潟県", "富山県", "石川県", "福井県", "山梨県", "長野県", "岐阜県",
    "静岡県", "愛知県", "三重県", "滋賀県", "京都府", "大阪府", "兵庫県",
    "奈良県", "和歌山県", "鳥取県", "島根県", "岡山県", "広島県", "山口県",
    "徳島県", "香川県", "愛媛県", "高知県", "福岡県", "佐賀県", "長崎県",
    "熊本県", "大分県", "宮崎県", "鹿児島県", "沖縄県"
)


PREF_EN = (
    "",
    "Hokkaido", "Aomori", "Iwate", "Miyagi", "Akita", "Yamagata", "Fukushima",
    "Ibaraki", "Tochigi", "Gunma", "Saitama", "Chiba", "Tokyo", "Kanagawa",
    "Niigata", "Toyama", "Ishikawa", "Fukui", "Yamanashi", "Nagano", "Gifu",
    "Shizuoka", "Aichi", "Mie", "Shiga", "Kyoto", "Osaka", "Hyogo",
    "Nara", "Wakayama", "Tottori", "Shimane", "Okayama", "Hiroshima", "Yamaguchi",
    "Tokushima", "Kagawa", "Ehime", "Kochi", "Fukuoka", "Saga", "Nagasaki",
    "Kumamoto", "Oita", "Miyazaki", "Kagoshima", "Okinawa"
)


PREF_POS = (
	(0,0),
    (150,150),(545,60),(567,125),(552,190),(522,115),(508,190),(513,258),
    (513,330),(495,298),(453,308),(470,340),(520,368),(472,357),(472,379),
    (462,245),(373,305),(355,268),(327,343),(435,368),(412,333),(359,363),
    (415,400),(372,395),(340,432),(320,392),(283,381),(285,427),(258,400),
    (307,445),(287,470),(212,372),(148,387),(210,401),(162,422),(105,445),
    (230,460),(220,440),(165,463),(198,476),(63,477),(37,492),(28,523),
    (65,535),(95,495),(95,565),(60,590),(550,560) 
)


def get_pref(codes: set[int]) -> str:
    return "・".join(PREF_JP[code] for code in sorted(codes))
